app/views/orders/index.html.erb

          <td><center><%= order.id %></center></font></td>
          <td><%= order.order_number %></td>
---
SELECT `orders`.* FROM `orders`