app/controllers/orders_controller.rb

  def index
    #    render :text => params.inspect and return
    @orders = Order.all
---
SELECT `orders`.* FROM `orders`

  def create
    #raise params.inspect
  @orders = Order.all
  @products = Product.all
    @order = Order.new(:shipping_address => params[:orders][:shipping_address], :billing_address=>params[:orders][:billing_address])
    @order.user_id = session[:id]
    #   render :text => params.inspect and return
    unless params[:orders][:products].blank?
      @ordered_products =  params[:orders][:products]
      if @order.save
        n = 0
        @ordered_products.each do |product_id|
          product = Product.find product_id.to_i
          order_line_item = @order.orderlineitems.create(:user_id => session[:id], :product_id => product_id, :quantity => params[:orders][:quantity][n])
#          if Stock < 0
#            flash[:notice] = "Your Quantity exceeds the stock"
#            redirect_to :action => "index"
#          end
          stock = product.product_stock.to_i - order_line_item.quantity.to_i
          product.update_attributes(:product_stock => stock)
---
SELECT `orders`.* FROM `orders`
SELECT `products`.* FROM `products`
INSERT INTO `orders` (`billing_address`, `user_id`, `order_number`, `shipping_address`) VALUES ('dsdewrwer', 1, NULL, 'zzefrwrwrewr')
SELECT `products`.* FROM `products` WHERE `products`.`id` = 1 LIMIT 1
INSERT INTO `orderlineitems` (`order_id`, `product_id`, `quantity`, `user_id`) VALUES (230, '--- !map:ActiveSupport::HashWithIndifferentAccess \n,products.id: \"1\"\n', NULL, 1)
UPDATE `products` SET `product_stock` = -30 WHERE `products`.`id` = 1

  def show
    @order = Order.find(params[:id])
---
SELECT `orders`.* FROM `orders` WHERE `orders`.`id` = 140 LIMIT 1

  def destroy
    @order = Order.find(params[:id])
    @order.destroy
---
SELECT `orders`.* FROM `orders` WHERE `orders`.`id` = 148 LIMIT 1
DELETE FROM `orders` WHERE `orders`.`id` = 148