app/controllers/orderlineitems_controller.rb

  def index
    @olitems = Orderlineitem.all
---
SELECT `orderlineitems`.* FROM `orderlineitems`

  def destroy
    @olitem = Orderlineitem.find(params[:id])
    @olitem.destroy
---
SELECT `orderlineitems`.* FROM `orderlineitems` WHERE `orderlineitems`.`id` = 328 LIMIT 1
DELETE FROM `orderlineitems` WHERE `orderlineitems`.`id` = 328