app/controllers/products_controller.rb

SELECT `products`.* FROM `products` LIMIT 1
---
  def index
    @products = Product.all

INSERT INTO `products` (`product_stock`, `product_name`, `price_per_piece`, `product_company`, `product_sub_cat`, `product_model`, `product_cat`) VALUES (500, 'SmartPhone', 12000.0, 'Sony_Ericsson', 'Sony_Ericsson', '5230', 'Mobiles')
---
  def create
    @product = Product.new(params[:product])
    if
      @product.save