app/controllers/users_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
  def activate
    #    raise params[:id].inspect
    @user= User.find(params[:id])